# <font color="purple"><h3 align="center">Dataframe and mysql database tutorial</h3></font>

In [ ]:
import pandas as pd
import sqlalchemy

In [ ]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:@localhost:3306/application')

Format of connection string is:

mysql+pymysql://username:password@host:port/database_name

Format of connection string for other databases

https://pandas.pydata.org/pandas-docs/stable/io.html#engine-connection-examples

<img src="https://github.com/codebasics/py/blob/master/pandas/21_sql/conn_string_format.JPG?raw=1"/>

<h3 style="color:purple">Read entire table in a dataframe using <span style="color:blue">read_sql_table</span></h3>

In [ ]:
df = pd.read_sql_table('customers',engine)
df

   id    name phone_number
0   1  Donald   7326784567
1   2    Bill   6573489999
2   3    Modi   4567895646

**Read only selected columns**

In [ ]:
df = pd.read_sql_table('customers', engine, columns=["name"])
df

     name
0  Donald
1    Bill
2    Modi

<h3 style="color:purple">Join two tables and read them in a dataframe using <span style="color:blue">read_sql_query</span></h3>

In [ ]:
df = pd.read_sql_query("select id,name from customers",engine)
df

   id    name
0   1  Donald
1   2    Bill
2   3    Modi

In [ ]:
query = '''
 SELECT customers.name, customers.phone_number, orders.name, orders.amount
 FROM customers INNER JOIN orders
 ON customers.id=orders.customer_id
'''
df = pd.read_sql_query(query,engine)
df

     name phone_number          name  amount
0  Donald   7326784567  Google Pixel   950.0
1    Bill   6573489999      Yoga Mat    20.0
2    Modi   4567895646  Fossil Watch   120.0

<h3 style="color:purple"><span style="color:blue">read_sql</span> is a wrapper around read_sql_query and read_sql_table</h3>

In [ ]:
query = '''
 SELECT customers.name, customers.phone_number, orders.name, orders.amount
 FROM customers INNER JOIN orders
 ON customers.id=orders.customer_id
'''
pd.read_sql(query,engine)

     name phone_number          name  amount
0    Bill   6573489999      Yoga Mat    20.0
1  Donald   7326784567  Google Pixel   950.0
2    Modi   4567895646  Fossil Watch   120.0

In [ ]:
pd.read_sql("customers",engine)

   id             name phone_number
0   1           Donald   7326784567
1   2             Bill   6573489999
2   3             Modi   4567895646
3  10     rafael nadal   4567895647
4  11  maria sharapova    434534545
5  12   vladimir putin     89345345
6  13      kim un jong    123434456
7  14       jeff bezos    934534543
8  15     rahul gandhi     44324222

<h3 style="color:purple">Write to mysql database using <span style="color:blue">to_sql</span></h3>

In [ ]:
df = pd.read_csv("customers.csv")
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [ ]:
df.rename(columns={
    'Customer Name': 'name',
    'Customer Phone': 'phone_number'
}, inplace=True)
df

              name  phone_number
0     rafael nadal    4567895647
1  maria sharapova     434534545
2   vladimir putin      89345345
3      kim un jong     123434456
4       jeff bezos     934534543
5     rahul gandhi      44324222

In [ ]:
df.to_sql(
    name='customers', # database table name
    con=engine,
    if_exists='append',
    index=False
)

**to_sql has different parameters such as chunksize which allows to write data in chunks. This is useful when 
size of dataframe is huge**

# Introduction to SQL Sub-Queries

This notebook explore the basics of the use of sub-queries with SQL

In [ ]:
# CREATING THE TABLE
import sqlite3

conn = sqlite3.connect('test.db')
print("Opened database successfully");

conn.execute('''
CREATE TABLE IF NOT EXISTS team_data(team text, 
                      country text, 
                      season integer, 
                      total_goals integer);''')

conn.commit()

print("Table created successfully");

conn.close()

Opened database successfully
Table created successfully

In [ ]:
# INSERTING VALUES

conn.execute("INSERT INTO team_data VALUES('Real Madrid', 'Spain', 2019, 53);")
conn.execute("INSERT INTO team_data VALUES('Barcelona', 'Spain', 2019, 47);")
conn.execute("INSERT INTO team_data VALUES('Arsenal', 'UK', 2019, 52);")
conn.execute("INSERT INTO team_data VALUES('Real Madrid', 'Spain', 2018, 49);")
conn.execute("INSERT INTO team_data VALUES('Barcelona', 'Spain', 2018, 45);")
conn.execute("INSERT INTO team_data VALUES('Arsenal', 'UK', 2018, 50 );")

conn.commit()

In [ ]:
# Average goal by team

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team,
                            AVG(total_goals) AS avg_goals
                          FROM team_data
                          GROUP BY team;''')

for row in cursor:
  print(row)
conn.close()

('Arsenal', 51.0)
('Barcelona', 46.0)
('Real Madrid', 51.0)

In [ ]:
# First try to filter the teams with average goals higher than 50
# This query will generate an error

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team AS team_name,
                            AVG(total_goals) AS avg_goals
                          FROM team_data
                          WHERE avg_goals > 50
                          GROUP BY team;''')

for row in cursor:
  print(row)
conn.close()

ERROR:root:An unexpected error occurred while tokenizing input
The following traceback may be corrupted or invalid
The error message is: ('EOF in multi-line string', (1, 40))

OperationalError: ignored

In [ ]:
# Now, the correct query, using the appropriate sub-query

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team_name, avg_goals
                          FROM (

                          -- Here we make our sub-query:
                            SELECT team AS team_name,
                            AVG(total_goals) AS avg_goals
                            FROM team_data
                            GROUP BY team) tp
                          -- End of the sub-query
                          
                          WHERE avg_goals > 50;''')

for row in cursor:
  print(row)
conn.close()

('Arsenal', 51.0)
('Real Madrid', 51.0)

That's it, this code should be used as a complement to the article

# Intro

In [ ]:
!pip install db-sqlite3

Requirement already satisfied: db-sqlite3 in /usr/local/lib/python3.6/dist-packages (0.0.1)
Requirement already satisfied: db in /usr/local/lib/python3.6/dist-packages (from db-sqlite3) (0.1.1)
Requirement already satisfied: antiorm in /usr/local/lib/python3.6/dist-packages (from db->db-sqlite3) (1.2.1)

In [ ]:
import pandas as pd
import sqlite3
from datetime import date

In [ ]:
#connecting with the database.
db = sqlite3.connect("testing.db")
db.execute("drop table if exists results")
try:
  db.execute("create table results(Name text, Date datetime, Mobile text,Mail text)")
except:
  print("Already table existed !!")

In [ ]:
db = sqlite3.connect("testing.db")

In [ ]:
Date = date.today().strftime("%d-%m-%Y")
Name = "TestDemo"
Mobile = "9000011101"
Mail = "teachineMachine1@you.com"

In [ ]:
cmd = "insert into results(Name, Mobile,Date,Mail) values('{}','{}','{}','{}')".format(Name,Mobile,Date,Mail)
db.execute(cmd)
db.commit()

# Querying

### Type - 1 Querying

In [ ]:
db = sqlite3.connect("testing.db")
rs = db.execute('SELECT * FROM results')
for row in rs:
    print (row)

('TestDemo', '18-08-2020', '9000011101', 'teachineMachine1@you.com')
('TestDemo', '18-08-2020', '9000011101', 'teachineMachine1@you.com')

### Type - 2 Querying

In [ ]:
db = sqlite3.connect("testing.db")
qry = """

SELECT * FROM results

"""
df = pd.read_sql_query(qry, db)
df.head()

       Name        Date      Mobile                      Mail
0  TestDemo  18-08-2020  9000011101  teachineMachine1@you.com
1  TestDemo  18-08-2020  9000011101  teachineMachine1@you.com

# Batch-wise data storage

In [ ]:

def pushtoDB(Name,Mobile,Mail):
#inserting values inside the created table
    db = sqlite3.connect("testing.db")    
    from datetime import date
    Date = date.today().strftime("%d-%m-%Y")
    cmd = "insert into results(Name, Mobile,Date,Mail) values('{}','{}','{}','{}')".format(Name,Mobile,Date,Mail)
    db.execute(cmd)
    db.commit()

In [ ]:
data = pd.read_csv("dummy.csv")
data.head()
data.shape

(1128, 3)

In [ ]:
pushtoDB("Testttt","121","2112")

In [ ]:
db = sqlite3.connect("testing.db")
qry = "SELECT * FROM results"
df = pd.read_sql_query(qry, db)
df.head()

       Name        Date      Mobile                      Mail
0  TestDemo  18-08-2020  9000011101  teachineMachine1@you.com
1  TestDemo  18-08-2020  9000011101  teachineMachine1@you.com
2   Testttt  18-08-2020         121                      2112

In [ ]:
for i in range(0,len(data)):
  pushtoDB(data.iloc[i][0],data.iloc[i][1],data.iloc[i][2])

In [ ]:
db = sqlite3.connect("testing.db")
qry = """

SELECT * FROM results WHERE Name="TestDemo"

"""
df = pd.read_sql_query(qry, db)
df.head()

       Name        Date      Mobile                      Mail
0  TestDemo  18-08-2020  9000011101  teachineMachine1@you.com
1  TestDemo  18-08-2020  9000011101  teachineMachine1@you.com